akgupt3/freebsd/share/man/man4/ionic.4
.\" Copyright (c) 2017-2019 Pensandoi Systems, Inc. or its affiliates.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
.\" OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
.\" OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd August 12, 2019
.Dt IONIC 4
.Os
.Sh NAME
.Nm ionic
.Nd "FreeBSD kernel driver for Pensando Ethernet Adapter"
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device ionic"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_ionic_load="YES"
.Ed
.Sh DESCRIPTION
The IONIC is NIC (networking interface card) supporting maximum of 100GbE
link speed. Driver supports industry standard features like Jumbo frames,
Tx/Rx checksum support, TCP segmentation support (TSO), Large Receive
Offload(LRO), Hardware VLAN offloads, Receive Side Steering (RSS) for IPV4
and IPv6.
.Sh HARDWARE
Supported PCI vendor ID/device IDs:
.Pp
.Bl -bullet -compact
.It
1dd8:1002 - Pensando uplink 100G port
.It
1dd8:1004 - Pensando ethernet managment interface
.El
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Bl -tag -width indent
.It Va hw.ionic.tx_descs
Set the number of descriptors in the TX rings, minimum is 16
and maximum is 65536. Default is 2048.
.It Va hw.ionic.rx_descs
Set the number of descriptors in the RX rings, minimum is 16
and maximum is 65536. Default is 2048.
.It Va hw.ionic.max_queues
Set the number of queues (each a TX/RX pair) for the port, this
allows one to override the autocalculation based on number of cores
and alos based on interrupt resources available if it is set to 0.
.It Va hw.ionic.intr_coalesce
Set the interrupt coalescing values in micro seconds for TX/RX
queue pairs. 
.El
.Sh SYSCTL 
.Bl -tag -width indent
.It Va dev.ionic.#.fw_version
This is a display of the Firmware version.
.It Va dev.ionic.#.fw
This is a display of the Firmware statistic counters.
.It Va dev.ionic.#.mac
This is a display of the MAC/PHY statistic counters.
.El
.Sh SUPPORT
If an issue is identified with the released source code with a supported adapter
email the specific information related to the issue to
.Aq Anish anish@freebsd.org
and
.Aq Pensando support drivers@pensando.io .
.Sh SEE ALSO
.Xr vlan 4 ,
.Xr ifconfig 8
.Sh AUTHORS
The
.Nm
driver was written by
.An Anish
